[
    {
        "author" : "cleary",
        "book" : "BCR",
        "case" : "At the end of the summer retreat Ts'ui Yen said to the community, \"All summer long I've been talking to you, brothers; look and see if my eyebrows are still there.\"M Pao Fu said, \"The thief's heart is cowardly.\" Ch'ang Ch'ing said, \"Grown.\" Yun Men said, \"A barrier.\"",
        "case_number" : "8",
        "id" : 8,
        "name" : "Ts'ui Yen's Eyebrows"
    },
    {
        "author" : "wonderwheel",
        "book" : "BCR",
        "case_number" : "78",
        "id" : 78,
        "verse" : "In ancient times there were 16 bodhisattvas. At the time for monks to bathe they followed the custom and entered the bath, and suddenly awoke by the primary cause of water.\n\nAll you Virtuous Ones of Zen, how do you make it alive to comprehend them saying, “The wonderful touch proclaims the brilliance and becomes the abode of the Buddha’s children.”\n\nAlso, [you] must do eight holes in seven borings to begin to get it."
    },
    {
        "author" : "wonderwheel",
        "book" : "BCR",
        "case" : "A monk asked Yaoshan (Medicine Mountain), “In a level field of shallow grass a great stag and the deer became a herd.[fn81]  So how is one able to shoot and get the great stag among the great stags?”\n\nShan said, “Look... an arrow.”\n\nThe monk lay down his body then rolled over.\n\nShan said, “Attendant, drag out this dead fellow.”\n\nThe monk then departed swiftly.\n\nShan said, “What limit is there for this fellow’s playing with mud balls?”\n\n \n\nXuedou picked it up and said, “Although in three steps he lived, in five steps he had to die gaping at the great stag.”",
        "case_number" : "81",
        "id" : 81,
        "name" : "Yaoshan Observes an Arrow"
    },
    {
        "author" : "wonderwheel",
        "book" : "BCR",
        "case" : "Yunmen said in handing down words, “In every last person there is the brightness of light. When looking, it is unseen endless darkness.  How do you make it live, this brightness of light of all people?”\n\nSubstituting for himself, he said, “The kitchen storehouse, the triple gate.”\n\nAgain he said, “Good things are not as good as nothing.”",
        "case_number" : "86",
        "id" : 86,
        "name" : "Yunmen’s Brightness of Light",
        "verse" : "Shining by itself, the solitary brightness lines up\n\nAnd flows unobstructed a single thread for you.\n\nThe flowers wither; the tree is without a shadow.\n\nWhen looking, who does not see?\n\nSeeing is not seeing.\n\nBackwards astride the ox, ahh!, to enter the Buddha sanctuary."
    },
    {
        "author" : "wonderwheel",
        "book" : "BCR",
        "case" : "Yunmen said in teaching the assembly, “’Medicine and disease cure each other.’  The entire great earth is medicine. What particularly is oneself?\n\n“Cure.”",
        "case_number" : "87",
        "id" : 87,
        "name" : "Yunmen’s Medicine and Disease",
        "verse" : "“The entire great Earth is Medicine.”\n\nFrom ancient times to the present, how extremely wrong!\n\nDon’t make the cart behind closed doors.\n\nThe path through is naturally desolate and empty.\n\nWrong. Wrong.\n\nYet, nostrils as far as heaven are also pierced."
    },
    {
        "author" : "wonderwheel",
        "book" : "BCR",
        "case" : "Xuansha, instructing the assembly, said, “In all directions the sojourning-elders welcomed situations to aide the living in the path leading to the destruction of suffering.  If you unexpectedly come to run into people with three kinds of maladies, how do you make it alive to welcome them?  With those who suffer from being blind, if you pick up the mallet or stand up the whisk, the other, too, does not see.  With those who suffer from being deaf, about the samadhi of language, the other, too, does not hear. With those who suffer from being mute, if you instruct them to speak, again they are not able to speak.  Just how do you make it alive to welcome them?   If you’re not able to welcome these people the Buddha Dharma is without verifiable effect.”\n\n \n\nA monk requested augmentation from Yunmen. Yunmen said, “Set forth your ceremonial-respects.”\n\nThe monk did the ceremonial obeisance and rose.  Yunmen used the staff to stab.  The monk withdrew backwards.\n\nMen said, “Indeed, you do not suffer from being blind.”\n\nAgain he called him to come near in front.  The monk neared in front.\n\nMen said, “Indeed, you do not suffer from being deaf.”\n\nMen thereupon said. “Reply, what do you understand?”\n\nThe monk said, “I do not understand.”\n\nMen said, “Indeed, you do not suffer from being mute.”\n\nThe monk had introspection into this.\n\nStare.\n\nYawn.\n\nStab.",
        "case_number" : "88",
        "id" : 88,
        "name" : "Xuansha’s Three Maladies"
    },
    {
        "author" : "cleary",
        "book" : "BOS",
        "case" : "Whenever Master Judi was asked a question, he would just raise one finger.",
        "case_number" : "84",
        "id" : 84,
        "name" : "Judi's \"One Finger\""
    },
    {
        "author" : "powell",
        "book" : "DONG",
        "case" : "During an evening lecture, when the lanterns were not lit, a monk came forward to raise a question and then withdrew. The Master had his attendant light the lanterns and then directed him to summon the monk who had raised the question. When the monk arrived, the Master said to his attendant, \"Obtain three pinches of powdered incense and give it to this shang-tso.\"\nThe monk swung his sleeves and left. From this he gained understanding, immediately got rid of his excess clothing and possessions, and set up a food kitchen.\nAfter three years he took leave of the Master.\n\"Be careful,\" said the Master.\nAt that time Hsüeh-feng, who was standing by the Master, asked, \"With regard to this monk who has just taken his leave, how long will it be before he returns?\"\nThe Master said, \"He knows only how to go, not how to come.\"\nThe monk returned to the Monk's Hall and, taking his place underneath the shelf for his bowls and robes, died while sitting. Hsüeh-feng came to report this to the Master.\nThe Master said, \"Even though he died like that, compared to this old monk, he differs by three rebirths.\"\n",
        "case_number" : "80",
        "id" : 80,
        "name" : "80"
    },
    {
        "author" : "cleary",
        "book" : "FOYAN",
        "case" : "ASSOCIATION WITH GOOD companions is a serious recommendation of the ancient sages. Students today should follow the words of the Buddhas and Patriarchs by finding a teacher to attain discernment. Otherwise, how can you call yourselves students?\nIf you want to clarify this matter, you must arouse wonder and look into it. If you wonder deeply about this matter, transcendental knowledge will become manifest. Why? The task of the journey just requires the sense of doubt to cease. If you do. not actively wonder, how can the sense of doubt cease?\nMy teacher was thirty-five years old before he became a monk. He stayed in the city of Chengdu to listen to lectures on The Hundred Phenomena as 'Only Representation. There he heard a saying of how when a Buddhist enters the path of insight, knowledge and principle merge, environment and mind join, and there is no distinction between that which realizes and that which is realized. A Hindu challenged the Buddhists, \"If there is no distinction between what realizes and what is realized, what is used as proof?\" No one could answer this challenge, so the Buddhists were declared the losers in debate. Later the Buddhist canonical master of Tang came to the rescue of the doctrine:\n\"When knowledge and principle merge, environment and mind unite, it is like when drinking water one spontaneously knows whether it is cool or warm.\"\nWhat about the travels of my late teacher calling on teachers — why did he later say he questioned an aged grandfather? What about selling and buying oneself — what is that? You should realize there is no excess; what the man of old said is all you.\nHe also said, \"I have never had a single statement to reach you. If I had a statement to reach you, what use would it be?\" Do you want your feeling of doubt broken? You too must be like my late teacher once before you can accomplish it.\nNow my teacher thought, \"It may be cool or warm, all right; but what is this business of spontaneous knowing?\" He wondered and questioned very deeply. He asked the lecturer about the principle of spontaneous knowing, but the lecturer couldn't answer; instead, he said, \"If you want to clarify this principle, I cannot explain it, but in the South there are adep'ts who have found out the source of the enlightened mind; they know about this matter. You will have to journey for it.\"\nSo my teacher went traveling. He went to the capital city, and all around the eastern riverlands, asking every Zen adept he could find about this matter. And everyone he asked gave him a reply. Some explained, some spoke in aphorisms. In any case, his feeling of doubt remained unbroken.\nLater he came to Fushan. Seeing that everything Fushan said in lectures and interviews was relevant to what was in his mind, he wound up staying for a year. Fushan had him contemplate the phrase, \"Buddha had a secret saying, Kasyapa didn't conceal it.\"\nOne day Fushan said to him, \"Why didn't you come earlier? You should go call on Baiyun Duan.\" So my teacher went to Baiyun. One day when he went into the teaching auditorium, all of a sudden he realized great enlightenment. \"'Buddha has a secret saying, Kasyapa didn't conceal it' — of course! Of course! When knowledge and principle merge, environment andmind unite, it is like when one drinks water one spontaneously knows whether it's warm or cool. How true these words are!\" Then he composed a verse on his attainment:\nAt an idle patch of field before the mountain\nPolitely I question an aged grandfather!\nHow many times have I sold and bought myself?\nCharmingly, the pine and bamboo draw a clear breeze.\nWhen Baiyun read this, he nodded. Is this no: a case of doubting and wondering profoundly, approaching people who know, and only then succeeding in clarification?\n",
        "case_number" : "28",
        "id" : 28,
        "name" : "Wonder"
    },
    {
        "author" : "blofeld",
        "book" : "HPO",
        "case" : "This pure Mind, the source of everything, shines forever and on all with the brilliance of its own perfection. But the people of the world do not awake to it, regarding only that which sees, hears, feels and knows as mind. Blinded by their own sight, hearing, feeling and knowing, they do not perceive the spiritual brilliance of the source-substance. If they would only eliminate all conceptual thought in a flash, that source-substance would manifest itself like the sun ascending through the void and illuminating the whole universe without hindrance or bounds. Therefore, if you students of the Way seek to progress through seeing, hearing, feeling and knowing, when you are deprived of your perceptions, your way to Mind will be cut off and you will find nowhere to enter. Only realize that, though real Mind is expressed in these perceptions, it neither forms part of them nor is separate from them. You should not start REASONING from these perceptions, nor allow them to give rise to conceptual thought; yet nor should you seek the One Mind apart from them or abandon them in your pursuit of the Dharma. Do not keep them nor abandon them nor dwell in them nor cleave to them.' Above, below and around you, all is spontaneously existing, for there is nowhere which is outside the Buddha-Mind.",
        "case_number" : "9",
        "id" : 9,
        "name" : "9"
    },
    {
        "author" : "bhikshu",
        "book" : "MAZU",
        "case" : "One day as Ch'an Master Pao-ch'e of Ma-ku was accompanying the Patriarch for a walk, he asked, \"What is the Great Nirvana?'\n\"Quickly!\" exclaimed the Patriarch.\n\"What quickly?\" asked Pao-ch'e.\n\"Look at the water,\" said the Patriarch.\n",
        "case_number" : "9",
        "id" : 9,
        "name" : "9",
        "NESTED TEST" : {
            "nested" : "blyth"
        }
    },
    {
        "author" : "blyth",
        "book" : "MMK",
        "case" : "A monk once asked Joshu, “Has a dog the Buddha-Nature?” \nJoshu answered，“Mu!” (No)",
        "case_number" : "1",
        "commentary" : "For the practical study of Zen, you must pass the barriers set up by the masters of Zen. The attainment of this mysterious illumination means cutting off the workings of the ordinary mind completely. If you have not done this and passed the barrier, you are a phantom among the under­growth and weeds. Now what is this barrier? It is simply \"Mu\", the Barrier of the Gate of Zen and this is why it is called \"The Gateless Barrier of the Zen Sect.\"\nThose who have passed the barrier are able not only to have an intimate understanding of Joshu, but also of the whole historic line of Zen Masters, to walk hand in hand with them, and to enter into the closest relation with them. You see everything with the same eye that they saw with, hear everything with the same ear. Is not this a blessed condition? Wouldn't you like to pass this barrier? Then concentrate your whole body, with its three hundred and sixty bones and joints, and eighty four thousand hair-holes, into this Question; day and night, without ceasing, hold it before you. But do not take it as nothingness, nor as the relative \"not\", of \"is\" and \"is not.\" It must be like a red-hot iron ball which you have gulped down and which you try to vomit, but cannot.\nAll the useless knowledge, all the wrong things' you have learned up to the present,—throw them away! After a certain period of time, this striv­ing will come to fruition naturally, in a state of internal and external unity. As with a dumb man who has had a dream, you will know it yourself, and for yourself only. Suddenly your whole activity is put into motion and you can astonish the heavens above and shake the earth beneath. You are just as if you had got hold of the great sword of Kan-u. You meet a Buddha? You kill him! A master of Zen? You kill him!\nThough you stand on the brink of life and death, you have the Great Freedom. In the four modes of the six rebirths you are in a state of peace and truth. Once more, how are you to concentrate on this Mu? Every ounce of energy you have must be expended on it; and if you do not give up on the way, another torch of the Law will be lighted.",
        "id" : 1,
        "name" : "Joshu’s Dog",
        "NESTED TEST" : {
            "nested" : "blyth",
            "tested" : {"a": ["sd", "sdds"], "b": true}
        }
    },
    {
        "author" : "blyth",
        "book" : ["MMK", "BOS"],
        "case" : "A monk, Seizei by name, said to Sozan, “I am a poor destitute monk. I beg you to bestow upon me the alms of salvation.” Sozan said, “Acarya Seizei!” “Yes, Sir?” replied Seizei. Sozan said, “Someone has drunk three bowls of the wine of Haku of Seigen, but asserts that he has not yet moistened his lips.”",
        "case_number" : "10",
        "commentary" : "Seizei is obsequious, but what is his real state of mind? Sozan, with his Buddha-eye, sees into the recesses of it, and understands the visitor's meaning. But however this may be so, just tell me, where and why does Acarya Seizei drink this wine?",
        "id" : 10,
        "name" : "Sozan And Poor Seizei",
        "verse" : "His poverty is like Hanzen's;\nHis spirit like that of Kou.\nThough he has no commercial system, \nThey are quarelling about riches."
    },
    {
        "author" : "blyth",
        "book" : 1,
        "case" : "Joshu went to a hermit’s and said, “Anything here? Anything here?” The hermit lifted up his fist. Joshu said, “The water is too shallow to anchor here,” and went away. He went to another hermit’s, and said, “Anything here? Anything here?” The hermit lifted up his fist. Joshu said, “Freely you give, freely you take away. Freely you bestow life, freely you destroy,” and made a profound bow.",
        "case_number" : "11",
        "commentary" : "Both stuck up their fists; why is one accepted, the other rejected? Just say, where is the source of confusion between the two? If, in regard to this you can speak a word of understanding, then you realise that Joshu's tongue has no bone in it. Now he raises up, now he dashes down, in perfect freedom. But though this is so, remember that the two hermits also saw through Joshu. Further, if you imagine that there is a comparison of superiority and inferiority to be made in regard to the two hermits, you have not an open eye. Neither have you an open eye if you suppose there is no difference of superiority and inferiority be­tween the two hermits.",
        "id" : 11,
        "name" : "Joshu’s Hermits",
        "verse" : "His eye is a shooting star;\nThe movements of his soul are like lightning. \nHe is a death-dealer,\nA life-giving sword."
    },
    {
        "author" : "wonderwheel",
        "book" : "MMK",
        "case" : "Venerable Nanquan: Because the Eastern and Western halls were arguing over a kitten, Quan therefore held it up and said, \"If the great assembly is able to speak quickly it can be saved, but if not able to speak quickly then it is eliminated by beheading.”\nThe Assembly was without a correct response, so Quan carried out the cat’s departure.\nIn the evening Zhaozhou returned from outside. Quan showed what happened to Zhou. Zhou consequently took off his shoes and placed them above his head and exited. \nQuan said \"Mister if you were there your quickness would have been able to save the kitten.\"",
        "case_number" : "14",
        "commentary" : "Just say, what was the living meaning of Zhaozhou putting the grass shoes on top of his head? If within you are able to issue one turning word, then you see Nanquan’s decree is not a vain act, and in that case maybe he is not dangerous.",
        "id" : 14,
        "name" : "Nanquan Beheads the Cat",
        "verse" : "If Zhaozhou were there,\nHis act would have turned the decree upside down,\nSeizing and removing the mister’s blade,\nLeaves Nanquan begging for life."
    },
    {
        "author" : "greene",
        "book" : "PANG",
        "case" : "One day, Master Tan—hsia T'ien—jan (Tanka Tennen) came to visit the Layman. He had just passed through the gate when he saw the Layman's daughter, Ling-chao, holding a basket of vegetables.\nTan—hsia said, \"Is the Layman here or not?\"\nLing—chao dropped the basket, stood up, and clasped her hands together on her chest.\nTan—hsia again asked, \"Is the Layman here or not?\"\nLing-chao picked up the basket and walked away, and Tan—hsia left.\nWhen the Layman returned home, Ling-chao told him what had happened.\nThe Layman said, \"Was it Tan-hsia?\"\nLing—chao said, \"He's gone now.\"\nThe Layman said, \"You've spilled the milk. in the mud.\"\nl3. Deaf and Dumb\nAfterward, Tan—hsia went to visit the Layman again. When the Layman saw him approaching, he didn't stand up or say anything.\nTan-hsia held up his whisk.\nThe Layman held up a pestle [that he was holding].\nTan—hsia said, \"That's it? Nothing else?\"\nThe Layman said, \"Now I see you have become a mas— ter. Things are not the same as they were before.\"\nTan—hsia said, \"Don't be prejudiced by appearances.\"\nThe Layman said, \"But you've already been put to the test once [when you came before]?\"\nTan—hsia said, \"I don't know why I said nothing then.\"\nThe Layman said, \"It was your right to say nothing. When I am annoyed, I also say nothing.\"\nTan—hsia lowered his Whisk and turned to leave.\nThe Layman called to him, saying, \"Brother Ian! Brother Ian!\" but Tan—hsia did not turn around.\n",
        "case_number" : "12",
        "id" : 12,
        "name" : "Meeting Ling-chao"
    },    
    {
        "author" : "cleary",
        "book" : "SHO",
        "case" : "Master Fadeng asked Yunji Ji, \"Just now someone asked about the meaning of the Chan founder coming from the West. I told him it is neither East nor West. What about you?\"\nJi said, \"Neither East nor West.\"\nFadeng said, \"How can you get it understanding this way?\"\nAt the time Ji was confused and didn't get the point. That evening he asked for help. Fadeng said, \"He naturally has descendants.\" At these words Ji suddenly attained awakening. He composed a verse saying,\nDealing with people to benefit the living is most wonderful; Alienating life after all is not good.\n'He naturally has descendants.'\nNow that you mention it,\nThe application's just right.\n",
        "case_number" : "100",
        "id" : 100,
        "name" : "100"
    },
    {
        "author" : "ursapp",
        "book" : "YUN",
        "case" : "A monk inquired, \"What is the meaning of the [Buddhist] teachings?\"\nThe Master asked back, \"What sutra are you reading?\"\nThe monk replied, \"The Wisdom Sutra.\"\nThe Master cited, \" 'All knowledge is pure.' Have you seen this even in a dream?\"\nThe monk said, \"Let's leave 'All knowledge is pure' aside. What is the meaning of the teachings?\"\nThe Master replied, \"If in your heart you had not failed someone, you would not be blushing! But I spare you the thirty blows of the staff [you deserve].\"\n",
        "case_number" : "17",
        "id" : 17,
        "name" : "17"
    }
]